variable "instance_count" {
  # Кількість інстансів EC2, які потрібно створити; за замовчуванням 2
  default = 2
}

variable "instance_type" {
  # Тип інстансу EC2, наприклад, "t2.micro", визначає ресурси інстансу
}

variable "ami" {
  # ID образу AMI, який буде використовуватися для створення інстансу EC2
}

variable "subnet_id" {
  # Список ідентифікаторів підмереж, де будуть розміщені EC2 інстанси
}

variable "security_group_id" {
  # Ідентифікатор групи безпеки, що визначає дозволені мережеві доступи до інстансу
}

variable "instance_tag" {
  # Теги для інстансів EC2, наприклад, назва проєкту або середовище
}

variable "key_name" {
  # Ім'я пари ключів SSH для доступу до інстансу EC2 через SSH
}