# Змінна для CIDR блоку VPC
variable "vpc_cidr_block" {
  # Тип не вказано, щоб дозволити динамічне призначення значення
}

# Змінна для CIDR блоку публічної підмережі
variable "public_subnet_cidr" {
  # Тип не вказано, значення також задається динамічно
}

# Змінна для типу EC2 інстансу (наприклад, t3.micro)
variable "instance_type" {
  # Тип не вказано, значення можна задавати під час виклику Terraform
}

# Змінна для списку портів, які будуть відкриті в Security Group
variable "list_of_open_ports" {
  type = list(number)  # Використовуємо список чисел для відкритих портів
}
