variable "lb_name" {
  # Ім'я для балансувальника навантаження (Load Balancer)
}

variable "target_group_name" {
  # Ім'я для цільової групи (Target Group), яка містить екземпляри EC2 для обробки трафіку
}

variable "listener_name" {
  # Ім'я для слухача (Listener) балансувальника, що керує правилами маршрутизації трафіку
}

variable "security_group_id" {
  # Ідентифікатор групи безпеки (Security Group ID), що дозволяє трафік до балансувальника
}

variable "vpc_id" {
  # Ідентифікатор VPC (Virtual Private Cloud), в якому створюється балансувальник
}

variable "public_subnet_id_1" {
  # Ідентифікатор першого публічного підмережевого сегменту (Subnet ID) для балансувальника
}

variable "public_subnet_id_2" {
  # Ідентифікатор другого публічного підмережевого сегменту (Subnet ID) для балансувальника
}

variable "instance_count" {
  # Кількість EC2 екземплярів, що будуть додані до цільової групи
}

variable "instance_ids" {
  # Список ідентифікаторів (IDs) екземплярів EC2, які є членами цільової групи
}

variable "lb_tag" {
  # Теги для балансувальника, що містять метадані, такі як ім'я проекту, середовище і власник
}
