# Використовуючи функцію, напишіть програму на Python. Функція має приймати дані від користувача.
# Програма повинна генерувати випадкове число від 1 до 100 і зберігати його в змінній. Користувачеві пропонується вгадати число.
# Якщо припущення користувача правильне, програма повинна надрукувати «Вітаємо! Ви вгадали правильне число». і вихід.
# Якщо припущення користувача неправильне, програма має надати зворотний зв’язок, як-от «Занадто високо» або «Занадто низько», і дозволити користувачеві
# вгадати ще раз. Користувач повинен мати максимум 5 спроб, щоб вгадати правильне число. Після 5 невдалих спроб програма повинна надрукувати Вибачте, у вас закінчилися спроби.
# Правильний номер був [правильний номер]» і вийти.

import random


def random_game():
    random_number = random.randint(1, 100)
    attempts = 5

    print("Вітаємо у грі 'Вгадай число'!")
    print("Ви маєте 5 спроб, щоб вгадати число від 1 до 100.")
    
    for attempt in range(1, attempts + 1):
        guess = int(input("Введіть Ваше число: "))
        if guess == random_number:
            print("Вітаємо! Ви вгадали правильне число.")
            return
        elif guess < random_number:
            print("Занадто низько.")
        else:
            print("Занадто високо.")
            
    print(f"Вибачте, у вас закінчилися спроби. Правильний номер був {random_number}.")
    
random_game()