# Змінна для типу EC2 інстансу (наприклад, t3.micro)
variable "instance_type" {
  # Тип не вказано, оскільки можна задавати тип динамічно
}

# Змінна для ідентифікатора підмережі, де буде створений інстанс
variable "subnet_id" {
  # Тип не вказано, оскільки підмережа також може бути різною в залежності від середовища
}

# Змінна для ідентифікатора Security Group, яка застосовується до інстансу
variable "security_group_id" {
  # Тип не вказано, щоб можна було гнучко використовувати різні Security Group
}

# Змінна для імені EC2 інстансу (ім'я для тегу або ідентифікації інстансу)
variable "instance_name" {
  # Тип не вказано, оскільки ім'я може задаватись динамічно
}

# Змінна для ідентифікатора AMI, який використовується для створення інстансу
variable "ami" {
  # Тип не вказано, AMI можна вибирати на основі регіону або вимог
}

# Змінна для ідентифікатора VPC, де буде розміщений інстанс
variable "vpc_id" {
  # Тип не вказано, щоб можна було використовувати різні VPC
}

# Змінна для передавання користувацького скрипта (User Data) для EC2 інстансу
variable "user_data" {
  # User Data передає скрипт для конфігурації інстансу на першому запуску
}

# Змінна для тегів EC2 інстансу
variable "instance_tag" {
  type = map(string)  # Використовуємо тип map для передачі ключ-значення для тегів
}
