# Ім'я для балансувальника навантаження, щоб ідентифікувати його серед інших ресурсів
variable "lb_name" {}

# Ім'я цільової групи, яка визначає набір інстансів для обробки трафіку від балансувальника
variable "target_group_name" {}

# Ім'я для Listener, який визначає правила для обробки вхідного трафіку
variable "listener_name" {}

# ID групи безпеки, що керує доступом до балансувальника навантаження
variable "security_group_id" {}

# ID VPC, в якій буде створений балансувальник навантаження
variable "vpc_id" {}

# Теги для балансувальника навантаження, що допомагають ідентифікувати та організувати ресурс
variable "lb_tag" {}

# ID першої публічної підмережі, де буде розміщено балансувальник навантаження
variable "public_subnet_id_1" {}

# ID другої публічної підмережі для розміщення балансувальника навантаження, щоб забезпечити відмовостійкість
variable "public_subnet_id_2" {}
